# 튜플은 어떻게 만들까?

t1 = ()
t2 = (1,)
t3 = (1, 2, 3)
t4 = 1, 2, 3
t5 = ('a', 'b', ('ab', 'cd'))

print()
#------------------------------------------------------------------------------------
# 튜플의 요솟값을 지우거나 변경하려고 하면 어떻게 될까?

# 1. 튜플 요솟값을 삭제하려 할 때

t1 = (1, 2, 'a', 'b')
# del t1[0]

# 2. 튜플 요솟값을 변경하려 할 때

t1 = (1, 2, 'a', 'b')
# t1[0] = 'c'

# 요소 변경 불가

print()
#------------------------------------------------------------------------------------
# 튜플 다루기

# 인덱싱하기

t1 = (1, 2, 'a', 'b')
print(t1[0])
print(t1[3])

print()

# 슬라이싱하기

t1 = (1, 2, 'a', 'b')
print(t1[1:])

print()

# 튜플 더하기

t1 = (1, 2, 'a', 'b')
t2 = (3, 4)
t3 = t1 + t2
print(t3)
















